Конфигурация/InformationRegisters/СтатусыЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЖизненныйЦиклЦенныхБумаг</v8:Type>
						<v8:Type>cfg:EnumRef.ТорговыеСтатусыЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатусыЦенныхБумаг/Ext/ManagerModule.bsl
Функция ПолучитьСтатус(ЦеннаяБумага, Статус, Биржа = Неопределено, Рынок = Неопределено, ДатаПереоценки, ЗначениеПоУмолчанию = Ложь) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыЦенныхБумагСрезПоследних.Активен КАК Активен
		|ИЗ
		|	РегистрСведений.СтатусыЦенныхБумаг.СрезПоследних(
		|			&ДатаПереоценки,
		|			ЦеннаяБумага = &ЦеннаяБумага
		|				И Статус = &Статус
		|				И Биржа = &Биржа
		|				И Рынок = &Рынок) КАК СтатусыЦенныхБумагСрезПоследних");
	
	Если Биржа = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Биржа = &Биржа", "");
	КонецЕсли;
	
	Если Рынок = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Рынок = &Рынок", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаПереоценки",	ДатаПереоценки);
	Запрос.УстановитьПараметр("ЦеннаяБумага",	ЦеннаяБумага);
	Запрос.УстановитьПараметр("Статус",			Статус);
	Запрос.УстановитьПараметр("Биржа",			Биржа);
	Запрос.УстановитьПараметр("Рынок",			Рынок);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат ?(ВыборкаЗапроса.Следующий(), ВыборкаЗапроса.Активен, ЗначениеПоУмолчанию); 
		
КонецФункции
